/*// 1. Упрощение написания кода - "Интерполяция строк"	
string name = Mark;
Console.WriteLine($"Hello, {name}");
int a = 45654564;
double db = 123.122;
Console.WriteLine($"Результат равен = {a} shsdadhash {db}");
*/
/*
// 2. Данный код пытается(int.Try) преобразовать значение которое ввел пользователь из текста в число. Полезно в том случае когда пользователь ввел число, а нужно текст. И наоборот
int number = int.Parse(Console.ReadLine());
bool isParsed = int.TryParse(Console.ReadLine(), out int number);
if (!isParsed) ;
{
    Console.WriteLine("Введено не правильное значение");
}
// Также дальнешая работа: Если не правильное значение выдает ошибку с просьбой написать правильно
*/



// 3. var комбенированный тип данных для упрощения (чтобы не указывать каждый тип данных int, string)


/*
4. Код break экстренно остановаливает последующие действия только внутри циклов.
Код return экстренно остановаливает последующие действия только внутри методов.

1 Практика
📖 Настоятельно рекомендуем всем:
• «C# для школьников»
• Мартин Дрейер

2 Практика
• «Язык программирования C# и платформа .NET»
• Троелсен Эндрю
• Джепикс Филипп

3 Практика
• «ASP.NET Core. Разработка приложений» https://dotnet.microsoft.com/en-us/apps/aspnet
• Джеймс Чамберс
• Дэвид Пэкетт
• Саймон Тиммс

4 Практика
• «C# Полное руководство», Шилдт Г.
• «Программирование на C# для начинающих. Особенности языка», Васильев Алексей Николаевич
• «Разработка обслуживаемых программ на языке C#», Джуст Виссер

5 Практика
• 💯Книга, по которая помогает пройти собеседование на C# Junior:
«CLR via C#. Программирование на платформе Microsoft .NET», Рихтер Дж.


6 Практика

7 Практика

8 Практика

*/

