/* 
 * concat(): объединение строк
 * valueOf(): преобразует Object в строковое представление (завязан на toString())
 * join(): объединяет набор строк в одну с учетом разделителя
 * charAt(): получение символа по индексу
 * indexOf(): первый индекс вхождения подстроки
 * lastIndexOf(): последний индекс вхождения подстроки
 * replace(): замена одной подстроки на другую 
 * startsWith()/endsWith(): определяет, начинается/заканчивается ли строка с подстроки
 
 * trim(): удаляет начальные и конечные пробелы
 * substring(): возвращает подстроку, см.аргументы
 * toLowerCase()/toUpperCase(): возвращает новую строку в нижнем/верхнем регистре
 * сompareTo(): сравнивает две строки
 * equals(): сравнивает строки с учетом регистра
 * equalsIgnoreCase(): сравнивает строки без учета регистра
 * regionMatches(): сравнивает подстроки в строках
 
 
 
 Если много изменяете полученную строку, выгоднее использовать StringBuilder
 Если много ищете или перебираете полученную строку, выгоднее использовать String




 
 
 
 */