// Напишите метод, который сжимает строку.
// Пример: вход aaaabbbcdd
// Ответ: a4b3cd2

import java.util.Scanner;

/**
 * sem_3
 */
public class sem_3 {
 public static void main(String[] args) {
  Scanner cs = new Scanner(System.in, "cp866");
  System.out.println("Введите строку: ");
  String input = cs.nextLine();

  Integer couter = 0;

  if (input.length() < 1)
   System.out.println("Ошибка! Прошу ввести значение.");
  else {
   for (int i = 0; i < input.length(); i++) {

   }
  }

 }

}